/*------------------------------------------------------------------------------------------------------/

[ファイル名	:object.cpp]
製作者	:AT12B171 竹山広人
概要	:オブジェクト抽象クラス

-------------------------------------------------------------------------------------------------------*/

/*------------------------------------------------------------------------------------------------------/

更新履歴

|month /date	|h:m	|name		|ここに更新内容を記述

-------------------------------------------------------------------------------------------------------*/
//********** インクルード **********
#include "object.h"

//********** 定数・マクロ **********

//**********グローバル宣言**********

C_OBJECT::C_OBJECT(){
	m_object = NULL;
	m_objectNumMax = 0;
	m_objectType = 0;
}

C_OBJECT::~C_OBJECT(){
	Uninit();
}

void C_OBJECT::Uninit(){
	if (!m_object) return;

	delete[] m_object;
	m_object = NULL;
	
}

void C_OBJECT::Draw(){
	for (int i = 0; i < m_objectNumMax; i++) m_object->Draw();
}
